      
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.vercel_project_directory.directory: Reading...[0m[0m
[0m[1mvercel_project.portfolio: Refreshing state... [id=prj_zT5vWIz9c1ApeyPf5hbnEYgLhxEX][0m
[0m[1mdata.vercel_project_directory.directory: Read complete after 0s [id=../../../doppelgengar.dev][0m
[0m[1mvercel_project_domain.wwwstaging: Refreshing state... [id=www.staging.doppelgengar.dev][0m
[0m[1mvercel_project_domain.staging: Refreshing state... [id=staging.doppelgengar.dev][0m
[0m[1mvercel_deployment.deployment: Refreshing state... [id=dpl_Ff1sRw52hhr7mLeFDQqLZsqVn8qX][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # vercel_deployment.deployment[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "vercel_deployment" "deployment" {
      [33m~[0m[0m domains     = [ [31m# forces replacement[0m[0m
          [31m-[0m[0m "staging.doppelgengar.dev",
          [31m-[0m[0m "www.staging.doppelgengar.dev",
          [31m-[0m[0m "staging-doppelgengar-portfolio.vercel.app",
          [31m-[0m[0m "staging-doppelgengar-portfolio-kyle-moreiras-projects.vercel.app",
        ] -> (known after apply) [31m# forces replacement[0m[0m
      [33m~[0m[0m files       = { [31m# forces replacement[0m[0m
          [31m-[0m[0m "../../../doppelgengar.dev/README.md"                        = "1383~7186f4406725e6e20e302dd4d649698b641e8e3b" [90m-> null[0m[0m
          [32m+[0m[0m "../../../doppelgengar.dev/app/layout.tsx"                   = "679~57ce88f68807fe613eae29b5830e923ab49c9397"
          [32m+[0m[0m "../../../doppelgengar.dev/app/page.tsx"                     = "383~b63db30486260b9588082de2e648187af6ff8dd7"
          [32m+[0m[0m "../../../doppelgengar.dev/app/ui/navigation/nav-header.tsx" = "291~5058d680938da569da727967129c7df05c277dd0"
          [32m+[0m[0m "../../../doppelgengar.dev/app/ui/navigation/nav-link.tsx"   = "920~4ce8828f034087f6db2dca1386af8b6ae7327a68"
          [32m+[0m[0m "../../../doppelgengar.dev/app/ui/styles/globals.css"        = "399~8fa2b18e2d50be02b9f26e48efd5daddeb2b6166"
          [33m~[0m[0m "../../../doppelgengar.dev/package-lock.json"                = "174098~26944610ab201d439e8fa3942c8e4d5bebd8a88b" [33m->[0m[0m "241639~356fed0b515b86d3930588c8dab98992e83309fc"
          [33m~[0m[0m "../../../doppelgengar.dev/package.json"                     = "579~3bfd6db639df34e1ed396735adad4cbe76f5d944" [33m->[0m[0m "811~20f64b1d1fc0cb82ea9a9a10c613322d31df3c67"
          [32m+[0m[0m "../../../doppelgengar.dev/prettier.config.js"               = "167~b043c7a70f747f3902caed0e47a9e50da6fba799"
          [31m-[0m[0m "../../../doppelgengar.dev/public/logo.svg"                  = "507~b5187b443b86e3852de433d8258ced9164d36079" [90m-> null[0m[0m
          [31m-[0m[0m "../../../doppelgengar.dev/src/app/components/page.tsx"      = "408~c748cf9a1f6b4993b23f2c974911ba485836621e" [90m-> null[0m[0m
          [31m-[0m[0m "../../../doppelgengar.dev/src/app/layout.tsx"               = "517~2434e70976ad4dfa7cbc08d16c8cc5991c10effd" [90m-> null[0m[0m
          [31m-[0m[0m "../../../doppelgengar.dev/src/app/page.tsx"                 = "3055~0f6ad0950d4911e6eb7a9305d484675905c1f677" [90m-> null[0m[0m
          [31m-[0m[0m "../../../doppelgengar.dev/src/styles/globals.css"           = "183~f86c21ff30b83e1971e07863089424299c9bc51f" [90m-> null[0m[0m
          [31m-[0m[0m "../../../doppelgengar.dev/src/ui/navHeader.module.css"      = "263~06708eda3db8d798e4d3cc87e194580b8902f682" [90m-> null[0m[0m
          [31m-[0m[0m "../../../doppelgengar.dev/src/ui/navHeader.tsx"             = "445~3716e57bddba7303e3f0c010daf1b8e6933fea3d" [90m-> null[0m[0m
          [33m~[0m[0m "../../../doppelgengar.dev/tailwind.config.ts"               = "491~134637c2ce7fc2ce317edd688eea7a77c90eff95" [33m->[0m[0m "669~a6a3732093dcc9a01c5c0f7bc1404d5fe394a045"
          [33m~[0m[0m "../../../doppelgengar.dev/tsconfig.json"                    = "578~71beb4ab458ca43ab89af60332005d5eeb310700" [33m->[0m[0m "574~89d82c86074082c8a9847b3dae896ecf132360cd"
            [90m# (3 unchanged elements hidden)[0m[0m
        }
      [33m~[0m[0m id          = "dpl_Ff1sRw52hhr7mLeFDQqLZsqVn8qX" -> (known after apply)
      [32m+[0m[0m team_id     = (known after apply)
      [33m~[0m[0m url         = "staging-doppelgengar-portfolio-bgdcfr4uw-kyle-moreiras-projects.vercel.app" -> (known after apply)
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @DoppelG3ngar, Action: `pull_request`, Working Directory: `./terraform/environments/staging`, Workflow: `Pull request from feature branch`*